# RFM Analysis

**RFM analysis is a marketing technique used to quantitatively rank and group customers based on the recency, frequency and monetary total of their recent transactions to identify the best customers and perform targeted marketing campaigns.**

RFM analysis ranks each customer on the following factors:

Recency. How recent was the customer's last purchase? Customers who recently made a purchase will still have the product on their mind and are more likely to purchase or use the product again. Businesses often measure recency in days. But, depending on the product, they may measure it in years, weeks or even hours.


Frequency. How often did this customer make a purchase in a given period? Customers who purchased once are often are more likely to purchase again. Additionally, first time customers may be good targets for follow-up advertising to convert them into more frequent customers.


Monetary. How much money did the customer spend in a given period? Customers who spend a lot of money are more likely to spend money in the future and have a high value to a business.

## About Dataset

This is a transnational data set which contains all the transactions occurring between 01/12/2010 and 09/12/2011 for a UK-based and registered non-store online retail. The company mainly sells unique all-occasion gifts. Many customers of the company are wholesalers.

In [59]:
# importing library

In [60]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import datetime as timedelta

In [61]:
data=pd.read_csv('Online Retail.csv',encoding='ISO-8859-1')

In [62]:
data.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

In [63]:
# Checking for null value

In [64]:
df.isnull().sum()

Recency      0
Frequency    0
monetary     0
F            0
M            0
R            0
RFM          0
RFM_level    0
dtype: int64

In [65]:
# Dropping Null Values

In [66]:
data=data.dropna()

In [67]:
data.isnull().sum()

InvoiceNo      0
StockCode      0
Description    0
Quantity       0
InvoiceDate    0
UnitPrice      0
CustomerID     0
Country        0
dtype: int64

In [68]:
# creating sales variable

In [69]:
data['sales']=data['Quantity']*data['UnitPrice']

In [70]:
data.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,sales
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34

In [71]:
# transform date variable

In [72]:
data['InvoiceDate']=pd.to_datetime(data['InvoiceDate'])

In [73]:
data['InvoiceDate']

0        2010-12-01 08:26:00
1        2010-12-01 08:26:00
2        2010-12-01 08:26:00
3        2010-12-01 08:26:00
4        2010-12-01 08:26:00
                 ...
541904   2011-12-09 12:50:00
541905   2011-12-09 12:50:00
541906   2011-12-09 12:50:00
541907   2011-12-09 12:50:00
541908   2011-12-09 12:50:00
Name: InvoiceDate, Length: 406829, dtype: datetime64[ns]

In [74]:
# lastest date

In [75]:
snapshot_date=data['InvoiceDate'].max()

In [76]:
snapshot_date

Timestamp('2011-12-09 12:50:00')

In [77]:
# Agrregate

In [78]:
df=data.groupby(['CustomerID']).agg({'InvoiceDate':lambda x : (snapshot_date-x.max()).days,'InvoiceNo':'count','sales':'sum'})

In [79]:
df.head()

            InvoiceDate  InvoiceNo    sales
CustomerID
12346.0             325          2     0.00
12347.0               1        182  4310.00
12348.0              74         31  1797.24
12349.0              18         73  1757.55
12350.0             309         17   334.40

In [80]:
# montary

In [81]:
df['monetary']=df.sales/df.InvoiceNo

In [82]:
df.head()

            InvoiceDate  InvoiceNo    sales   monetary
CustomerID
12346.0             325          2     0.00   0.000000
12347.0               1        182  4310.00  23.681319
12348.0              74         31  1797.24  57.975484
12349.0              18         73  1757.55  24.076027
12350.0             309         17   334.40  19.670588

In [83]:
# dropping sales

In [84]:
 df=df.drop(columns='sales')

In [85]:
df.head()

            InvoiceDate  InvoiceNo   monetary
CustomerID
12346.0             325          2   0.000000
12347.0               1        182  23.681319
12348.0              74         31  57.975484
12349.0              18         73  24.076027
12350.0             309         17  19.670588

In [86]:
# changing varibale names

In [87]:
df.rename(columns={'InvoiceDate':'Recency','InvoiceNo':'Frequency'},inplace=True)

In [88]:
df.head()

            Recency  Frequency   monetary
CustomerID
12346.0         325          2   0.000000
12347.0           1        182  23.681319
12348.0          74         31  57.975484
12349.0          18         73  24.076027
12350.0         309         17  19.670588

In [89]:
# RFM Prepration

## Dividing  recency , frequency , monetary columns data in 4 parts and assingning labels 1,2,3 and 4 to them

In [90]:
# creating Frequecy groups

In [91]:
# qcut divide data in quartile here label = range (1,5,1) means more frequent customer will get higher score.

In [92]:
df['F']=pd.qcut(x=df['Frequency'],q=4,labels=range(1,5,1))

In [93]:
df.head()

            Recency  Frequency   monetary  F
CustomerID
12346.0         325          2   0.000000  1
12347.0           1        182  23.681319  4
12348.0          74         31  57.975484  2
12349.0          18         73  24.076027  3
12350.0         309         17  19.670588  1

In [94]:
# qcut divide data in quartile here label = range (1,5,1) means customer spending more will get higher score.

In [95]:
df['M']=pd.qcut(x=df['monetary'],q=4,labels=range(1,5,1))

In [96]:
df.head()

            Recency  Frequency   monetary  F  M
CustomerID
12346.0         325          2   0.000000  1  1
12347.0           1        182  23.681319  4  4
12348.0          74         31  57.975484  2  4
12349.0          18         73  24.076027  3  4
12350.0         309         17  19.670588  1  3

In [97]:
# in r column range value will ne (4,0,-1) as more value value of Recenecy means customer is not active for long time

In [98]:
df['R']=pd.qcut(x=df['Recency'],q=4,labels=range(4,0,-1))

In [99]:
df.head()

            Recency  Frequency   monetary  F  M  R
CustomerID
12346.0         325          2   0.000000  1  1  1
12347.0           1        182  23.681319  4  4  4
12348.0          74         31  57.975484  2  4  2
12349.0          18         73  24.076027  3  4  3
12350.0         309         17  19.670588  1  3  1

In [100]:
df['RFM']=df[['R','F','M']].sum(axis=1)

In [101]:
df.head()

            Recency  Frequency   monetary  F  M  R  RFM
CustomerID
12346.0         325          2   0.000000  1  1  1    3
12347.0           1        182  23.681319  4  4  4   12
12348.0          74         31  57.975484  2  4  2    8
12349.0          18         73  24.076027  3  4  3   10
12350.0         309         17  19.670588  1  3  1    5

In [102]:
def rfm_segment(df):
    if df['RFM']>=11:
        return "SuperStar"
    elif ((df['RFM']>=8) and (df['RFM']<11)):
        return "Future Champion"
    elif ((df['RFM']>=6) and (df['RFM']<8)):
        return 'High Potential'
    else:
        return 'Low Relevance'

In [103]:
df['RFM_level']=df.apply(rfm_segment,axis=1)

In [104]:
df.head()

            Recency  Frequency   monetary  F  M  R  RFM        RFM_level
CustomerID
12346.0         325          2   0.000000  1  1  1    3    Low Relevance
12347.0           1        182  23.681319  4  4  4   12        SuperStar
12348.0          74         31  57.975484  2  4  2    8  Future Champion
12349.0          18         73  24.076027  3  4  3   10  Future Champion
12350.0         309         17  19.670588  1  3  1    5    Low Relevance

In [105]:
df.groupby('RFM_level').agg({"Recency":'mean',"Frequency":'mean',"monetary":['mean','count']})

                    Recency   Frequency   monetary
                       mean        mean       mean count
RFM_level
Future Champion   31.007919  135.835973  30.169670  1768
High Potential   117.708869   39.213947  38.033024  1477
Low Relevance    220.483400   22.811421  -0.586430   753
SuperStar          8.973262  244.852941  45.483949   374